{"class_name": "Sequential", "keras_version": "2.0.8", "backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "dtype": "float32", "name": "dense_15", "batch_input_shape": [null, 601], "kernel_constraint": null, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "elu", "units": 625, "kernel_regularizer": null}}, {"class_name": "Reshape", "config": {"trainable": true, "target_shape": [25, 25, 1], "name": "reshape_5"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "kernel_size": [20, 20], "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "name": "conv2d_15", "filters": 80, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "bias_constraint": null, "activation": "elu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_22"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "kernel_size": [10, 10], "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "name": "conv2d_16", "filters": 40, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "bias_constraint": null, "activation": "elu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_23"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "kernel_size": [5, 5], "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "name": "conv2d_17", "filters": 20, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "bias_constraint": null, "activation": "elu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_24"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "kernel_size": [5, 5], "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "name": "conv2d_18", "filters": 20, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "bias_constraint": null, "activation": "elu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_25"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_5"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "name": "dense_16", "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "elu", "units": 100, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_26"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "name": "dense_17", "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "elu", "units": 80, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_27"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "name": "dense_18", "kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "elu", "units": 60, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_28"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "name": "dense_19", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "units": 1, "kernel_regularizer": null}}]}