{"backend": "tensorflow", "keras_version": "2.0.8", "config": [{"config": {"dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "units": 115, "batch_input_shape": [null, 115], "kernel_constraint": null, "activation": "linear", "name": "dense_16", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "units": 100, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "kernel_constraint": null, "activation": "elu", "name": "dense_17", "activity_regularizer": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"rate": 0.2, "name": "dropout_10", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "units": 80, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "kernel_constraint": null, "activation": "elu", "name": "dense_18", "activity_regularizer": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"rate": 0.2, "name": "dropout_11", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "units": 60, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "kernel_constraint": null, "activation": "elu", "name": "dense_19", "activity_regularizer": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"rate": 0.2, "name": "dropout_12", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "units": 2, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "linear", "name": "dense_20", "activity_regularizer": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}